In [1]:
import pandas as pd

Learned from: Corey Schafer
https://www.youtube.com/playlist?list=PL-osiE80TeTsWmV9i9c58mdDCSskIFdDS

inplace=True apply changes to dataframe

In [2]:
person = {
    'first': "Asghar",
    'last' : "abbasi",
    'email': "abc@gmail.com"
}

In [3]:
people = {
    'first': ['Azhar'],
    'last' : ["Ali"],
    'email': ['Azhar@gmail.com']
}

In [4]:
people = {
    'first': ['Azhar', 'Ali', 'sahito','Humza','Ahmed'],
    'last' : ["Ali", "Sahito", "Azhar","Abbasi",'Mari'],
    'email': ['Azhar@gmail.com', 'ali@gmail.com', 'sahito@gmail.com', 'hamza@gmail.com','ahmed@gmail.com']
}

In [5]:
df = pd.DataFrame(people)
df

    first    last             email
0   Azhar     Ali   Azhar@gmail.com
1     Ali  Sahito     ali@gmail.com
2  sahito   Azhar  sahito@gmail.com
3   Humza  Abbasi   hamza@gmail.com
4   Ahmed    Mari   ahmed@gmail.com

In [6]:
df['email'] # preferred

0     Azhar@gmail.com
1       ali@gmail.com
2    sahito@gmail.com
3     hamza@gmail.com
4     ahmed@gmail.com
Name: email, dtype: object

In [7]:
df.email

0     Azhar@gmail.com
1       ali@gmail.com
2    sahito@gmail.com
3     hamza@gmail.com
4     ahmed@gmail.com
Name: email, dtype: object

In [8]:
df[['first','last']] # accessing multiple columns

    first    last
0   Azhar     Ali
1     Ali  Sahito
2  sahito   Azhar
3   Humza  Abbasi
4   Ahmed    Mari

In [9]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [10]:
df.iloc[2]  # index location

first              sahito
last                Azhar
email    sahito@gmail.com
Name: 2, dtype: object

In [11]:
df.iloc[[0,1]]  # index location

   first    last            email
0  Azhar     Ali  Azhar@gmail.com
1    Ali  Sahito    ali@gmail.com

In [12]:
df.iloc[[0,1],2]  # index location with specified column

0    Azhar@gmail.com
1      ali@gmail.com
Name: email, dtype: object

In [13]:
df.loc[[0,1]]

   first    last            email
0  Azhar     Ali  Azhar@gmail.com
1    Ali  Sahito    ali@gmail.com

In [14]:
df.loc[[0,1],'last']

0       Ali
1    Sahito
Name: last, dtype: object

In [15]:
# df.set_index('email', inplace=True)

In [16]:
# df

In [17]:
# df.loc['Azhar@gmail.com']

# Filtering Data

In [18]:
filt = (df['last'] == 'Ali')

In [19]:
df[filt]
df.loc[filt] #both wrok same but in loc we can pass column name like df.loc[filt,'last']

   first last            email
0  Azhar  Ali  Azhar@gmail.com

# Updating Rows and Columns

In [20]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [21]:
df.columns = ['first name','last name','User_email'] # Changing columns name method 1
df.columns

Index(['first name', 'last name', 'User_email'], dtype='object')

In [22]:
df.columns = [x.upper() for x in df.columns] # upper case columns names
df.columns

Index(['FIRST NAME', 'LAST NAME', 'USER_EMAIL'], dtype='object')

In [23]:
df.columns = df.columns.str.replace(' ','_')
df.columns

Index(['FIRST_NAME', 'LAST_NAME', 'USER_EMAIL'], dtype='object')

In [24]:
df.rename(columns={'FIRST_NAME':'first', 'LAST_NAME':"last"}, inplace=True) # Changing columns name method 2
df.rename(columns={'USER_EMAIL':'email'}, inplace=True)
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [25]:
df.loc[2] = ['Zohaib', 'chandio', 'ZOHAIB12@gmail.com'] # changing Row data 
print(df.loc[2])
df

first                Zohaib
last                chandio
email    ZOHAIB12@gmail.com
Name: 2, dtype: object

    first     last               email
0   Azhar      Ali     Azhar@gmail.com
1     Ali   Sahito       ali@gmail.com
2  Zohaib  chandio  ZOHAIB12@gmail.com
3   Humza   Abbasi     hamza@gmail.com
4   Ahmed     Mari     ahmed@gmail.com

In [26]:
df.loc[1,['first','email']] = ['Raza', 'raza1@gmail.com']
df

    first     last               email
0   Azhar      Ali     Azhar@gmail.com
1    Raza   Sahito     raza1@gmail.com
2  Zohaib  chandio  ZOHAIB12@gmail.com
3   Humza   Abbasi     hamza@gmail.com
4   Ahmed     Mari     ahmed@gmail.com

In [27]:
df.loc[0,'last'] ='Sahito' #change single value method 1
# df.at[0,'last'] = "ALI"    #method 2
df

    first     last               email
0   Azhar   Sahito     Azhar@gmail.com
1    Raza   Sahito     raza1@gmail.com
2  Zohaib  chandio  ZOHAIB12@gmail.com
3   Humza   Abbasi     hamza@gmail.com
4   Ahmed     Mari     ahmed@gmail.com

In [28]:
df['email'] = df['email'].str.upper() #Changing into upper case all emails both methods work same
df['email'].str.upper()
df

    first     last               email
0   Azhar   Sahito     AZHAR@GMAIL.COM
1    Raza   Sahito     RAZA1@GMAIL.COM
2  Zohaib  chandio  ZOHAIB12@GMAIL.COM
3   Humza   Abbasi     HAMZA@GMAIL.COM
4   Ahmed     Mari     AHMED@GMAIL.COM

In [29]:
df['email'].apply(len) # gives length of emails

0    15
1    15
2    18
3    15
4    15
Name: email, dtype: int64

In [30]:
def update_email(email):
    return email.upper()
df['email'].apply(update_email)
df

    first     last               email
0   Azhar   Sahito     AZHAR@GMAIL.COM
1    Raza   Sahito     RAZA1@GMAIL.COM
2  Zohaib  chandio  ZOHAIB12@GMAIL.COM
3   Humza   Abbasi     HAMZA@GMAIL.COM
4   Ahmed     Mari     AHMED@GMAIL.COM

In [31]:
df['email'] = df['email'].apply(lambda x: x.lower()) 
df

    first     last               email
0   Azhar   Sahito     azhar@gmail.com
1    Raza   Sahito     raza1@gmail.com
2  Zohaib  chandio  zohaib12@gmail.com
3   Humza   Abbasi     hamza@gmail.com
4   Ahmed     Mari     ahmed@gmail.com

In [32]:
df.apply(len) # gives values in row

first    5
last     5
email    5
dtype: int64

In [33]:
df.apply(pd.Series.min) # finding minimum value both method work same
# df.apply(lambda x : x.min())

first              Ahmed
last              Abbasi
email    ahmed@gmail.com
dtype: object

In [34]:
df.applymap(len)

   first  last  email
0      5     6     15
1      4     6     15
2      6     7     18
3      5     6     15
4      5     4     15

In [35]:
df.applymap(str.upper) # this just retrun copy of upper case values 
df = df.applymap(str.upper) #this replace dataframe with upper case values
df

    first     last               email
0   AZHAR   SAHITO     AZHAR@GMAIL.COM
1    RAZA   SAHITO     RAZA1@GMAIL.COM
2  ZOHAIB  CHANDIO  ZOHAIB12@GMAIL.COM
3   HUMZA   ABBASI     HAMZA@GMAIL.COM
4   AHMED     MARI     AHMED@GMAIL.COM

In [36]:
df['email'] = df['email'].replace({'RAZA1@GMAIL.COM':'razaChandio@gmail.com'})
df

    first     last                  email
0   AZHAR   SAHITO        AZHAR@GMAIL.COM
1    RAZA   SAHITO  razaChandio@gmail.com
2  ZOHAIB  CHANDIO     ZOHAIB12@GMAIL.COM
3   HUMZA   ABBASI        HAMZA@GMAIL.COM
4   AHMED     MARI        AHMED@GMAIL.COM

# Adding and removing columns

In [37]:
df['first'] + '_' + df['last'] #combining columns

0      AZHAR_SAHITO
1       RAZA_SAHITO
2    ZOHAIB_CHANDIO
3      HUMZA_ABBASI
4        AHMED_MARI
dtype: object

In [38]:
df['full_name'] = df['first'] + '_' + df['last']  #combining columns and creating new one
df

    first     last                  email       full_name
0   AZHAR   SAHITO        AZHAR@GMAIL.COM    AZHAR_SAHITO
1    RAZA   SAHITO  razaChandio@gmail.com     RAZA_SAHITO
2  ZOHAIB  CHANDIO     ZOHAIB12@GMAIL.COM  ZOHAIB_CHANDIO
3   HUMZA   ABBASI        HAMZA@GMAIL.COM    HUMZA_ABBASI
4   AHMED     MARI        AHMED@GMAIL.COM      AHMED_MARI

In [39]:
df.drop(columns=['last','first'],inplace=True) # removing columns
df

                   email       full_name
0        AZHAR@GMAIL.COM    AZHAR_SAHITO
1  razaChandio@gmail.com     RAZA_SAHITO
2     ZOHAIB12@GMAIL.COM  ZOHAIB_CHANDIO
3        HAMZA@GMAIL.COM    HUMZA_ABBASI
4        AHMED@GMAIL.COM      AHMED_MARI

In [40]:
df['full_name'].str.split('_')

0      [AZHAR, SAHITO]
1       [RAZA, SAHITO]
2    [ZOHAIB, CHANDIO]
3      [HUMZA, ABBASI]
4        [AHMED, MARI]
Name: full_name, dtype: object

In [41]:
df['full_name'].str.split('_', expand=True) #Expand gives new array

        0        1
0   AZHAR   SAHITO
1    RAZA   SAHITO
2  ZOHAIB  CHANDIO
3   HUMZA   ABBASI
4   AHMED     MARI

In [42]:
df[['first','last']] = df['full_name'].str.split('_', expand=True) # adding first and last column
df

                   email       full_name   first     last
0        AZHAR@GMAIL.COM    AZHAR_SAHITO   AZHAR   SAHITO
1  razaChandio@gmail.com     RAZA_SAHITO    RAZA   SAHITO
2     ZOHAIB12@GMAIL.COM  ZOHAIB_CHANDIO  ZOHAIB  CHANDIO
3        HAMZA@GMAIL.COM    HUMZA_ABBASI   HUMZA   ABBASI
4        AHMED@GMAIL.COM      AHMED_MARI   AHMED     MARI

In [43]:
df.append({'first':"Tony",'last':'Stark'},ignore_index=True)

C:\Users\asgha\AppData\Local\Temp\ipykernel_6152\2589580077.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append({'first':"Tony",'last':'Stark'},ignore_index=True)

                   email       full_name   first     last
0        AZHAR@GMAIL.COM    AZHAR_SAHITO   AZHAR   SAHITO
1  razaChandio@gmail.com     RAZA_SAHITO    RAZA   SAHITO
2     ZOHAIB12@GMAIL.COM  ZOHAIB_CHANDIO  ZOHAIB  CHANDIO
3        HAMZA@GMAIL.COM    HUMZA_ABBASI   HUMZA   ABBASI
4        AHMED@GMAIL.COM      AHMED_MARI   AHMED     MARI
5                    NaN             NaN    Tony    Stark

In [44]:
data = {
    'first':["Iron", "Captain"],
    'last' :['man', 'america'],
    'email':['inronmain07@gmail.com', 'captainam@gmail.com']
}
df2 =pd.DataFrame(data)
df2

     first     last                  email
0     Iron      man  inronmain07@gmail.com
1  Captain  america    captainam@gmail.com

In [45]:
# df=df.append(df2, ignore_index=True, sort=True) # old method 
df= pd.concat([df,df2], ignore_index=True) #new method
df

                   email       full_name    first     last
0        AZHAR@GMAIL.COM    AZHAR_SAHITO    AZHAR   SAHITO
1  razaChandio@gmail.com     RAZA_SAHITO     RAZA   SAHITO
2     ZOHAIB12@GMAIL.COM  ZOHAIB_CHANDIO   ZOHAIB  CHANDIO
3        HAMZA@GMAIL.COM    HUMZA_ABBASI    HUMZA   ABBASI
4        AHMED@GMAIL.COM      AHMED_MARI    AHMED     MARI
5  inronmain07@gmail.com             NaN     Iron      man
6    captainam@gmail.com             NaN  Captain  america

In [46]:
df['full_name'] = df['first']+'_'+df['last']
df

                   email        full_name    first     last
0        AZHAR@GMAIL.COM     AZHAR_SAHITO    AZHAR   SAHITO
1  razaChandio@gmail.com      RAZA_SAHITO     RAZA   SAHITO
2     ZOHAIB12@GMAIL.COM   ZOHAIB_CHANDIO   ZOHAIB  CHANDIO
3        HAMZA@GMAIL.COM     HUMZA_ABBASI    HUMZA   ABBASI
4        AHMED@GMAIL.COM       AHMED_MARI    AHMED     MARI
5  inronmain07@gmail.com         Iron_man     Iron      man
6    captainam@gmail.com  Captain_america  Captain  america

In [47]:
df.drop(index=5)

                   email        full_name    first     last
0        AZHAR@GMAIL.COM     AZHAR_SAHITO    AZHAR   SAHITO
1  razaChandio@gmail.com      RAZA_SAHITO     RAZA   SAHITO
2     ZOHAIB12@GMAIL.COM   ZOHAIB_CHANDIO   ZOHAIB  CHANDIO
3        HAMZA@GMAIL.COM     HUMZA_ABBASI    HUMZA   ABBASI
4        AHMED@GMAIL.COM       AHMED_MARI    AHMED     MARI
6    captainam@gmail.com  Captain_america  Captain  america

In [48]:
df.drop(index=df[df['first']  =='ZOHAIB'].index)
# or 
felt = df['first']  =='ZOHAIB'
df.drop(index=df[felt].index)

                   email        full_name    first     last
0        AZHAR@GMAIL.COM     AZHAR_SAHITO    AZHAR   SAHITO
1  razaChandio@gmail.com      RAZA_SAHITO     RAZA   SAHITO
3        HAMZA@GMAIL.COM     HUMZA_ABBASI    HUMZA   ABBASI
4        AHMED@GMAIL.COM       AHMED_MARI    AHMED     MARI
5  inronmain07@gmail.com         Iron_man     Iron      man
6    captainam@gmail.com  Captain_america  Captain  america

In [49]:
df= df.applymap(str.lower)

# Sorting Data

In [50]:
df.sort_values(by='last')
df.sort_values(by='last', ascending=False)
df.sort_values(by=['last','first']) # if last names same then sort with first name

                   email        full_name    first     last
3        hamza@gmail.com     humza_abbasi    humza   abbasi
6    captainam@gmail.com  captain_america  captain  america
2     zohaib12@gmail.com   zohaib_chandio   zohaib  chandio
5  inronmain07@gmail.com         iron_man     iron      man
4        ahmed@gmail.com       ahmed_mari    ahmed     mari
0        azhar@gmail.com     azhar_sahito    azhar   sahito
1  razachandio@gmail.com      raza_sahito     raza   sahito

In [51]:
df.sort_index()
df.sort_index(ascending=False)

                   email        full_name    first     last
6    captainam@gmail.com  captain_america  captain  america
5  inronmain07@gmail.com         iron_man     iron      man
4        ahmed@gmail.com       ahmed_mari    ahmed     mari
3        hamza@gmail.com     humza_abbasi    humza   abbasi
2     zohaib12@gmail.com   zohaib_chandio   zohaib  chandio
1  razachandio@gmail.com      raza_sahito     raza   sahito
0        azhar@gmail.com     azhar_sahito    azhar   sahito

In [52]:
df['last'].sort_values()

3     abbasi
6    america
2    chandio
5        man
4       mari
0     sahito
1     sahito
Name: last, dtype: object

# Cleaning Data - Casting Datatypes and Handling Missing Values

In [53]:
import numpy as np
people2 = {
    'first': ['Azhar', 'Ali', 'sahito', 'Humza', 'Ahmed', np.nan, None,"NA"],
    'last' : ["Ali", "Sahito", "Azhar",  None, 'Mari', np.nan, np.nan, 'Missing'],
    'email': ['Azhar@gmail.com', 'ali@gmail.com', 'sahito@gmail.com', 'hamza@gmail.com','ahmed@gmail.com', None, np.nan, "Anonymous@gmail.com"],
    'age'  : ['33', '55', '63', '36', None, None, 'Missing', "NA"]

}
df2 = pd.DataFrame(people2)
df2

    first     last                email      age
0   Azhar      Ali      Azhar@gmail.com       33
1     Ali   Sahito        ali@gmail.com       55
2  sahito    Azhar     sahito@gmail.com       63
3   Humza     None      hamza@gmail.com       36
4   Ahmed     Mari      ahmed@gmail.com     None
5     NaN      NaN                 None     None
6    None      NaN                  NaN  Missing
7      NA  Missing  Anonymous@gmail.com       NA

In [54]:
df2.dropna() # this show only rows that have all values

    first     last                email age
0   Azhar      Ali      Azhar@gmail.com  33
1     Ali   Sahito        ali@gmail.com  55
2  sahito    Azhar     sahito@gmail.com  63
7      NA  Missing  Anonymous@gmail.com  NA

In [55]:
df2.dropna(axis='index', how='any')

    first     last                email age
0   Azhar      Ali      Azhar@gmail.com  33
1     Ali   Sahito        ali@gmail.com  55
2  sahito    Azhar     sahito@gmail.com  63
7      NA  Missing  Anonymous@gmail.com  NA

In [56]:
df2.dropna(axis='index', how='all') # this also shows rows that has some value

    first     last                email      age
0   Azhar      Ali      Azhar@gmail.com       33
1     Ali   Sahito        ali@gmail.com       55
2  sahito    Azhar     sahito@gmail.com       63
3   Humza     None      hamza@gmail.com       36
4   Ahmed     Mari      ahmed@gmail.com     None
6    None      NaN                  NaN  Missing
7      NA  Missing  Anonymous@gmail.com       NA

In [57]:
df2.dropna(axis='index', how='all', subset=['last','email']) # one value should be there form both

    first     last                email   age
0   Azhar      Ali      Azhar@gmail.com    33
1     Ali   Sahito        ali@gmail.com    55
2  sahito    Azhar     sahito@gmail.com    63
3   Humza     None      hamza@gmail.com    36
4   Ahmed     Mari      ahmed@gmail.com  None
7      NA  Missing  Anonymous@gmail.com    NA

In [58]:
df2.dropna(axis='index', how='any', subset=['last','email']) # Both value should be there

    first     last                email   age
0   Azhar      Ali      Azhar@gmail.com    33
1     Ali   Sahito        ali@gmail.com    55
2  sahito    Azhar     sahito@gmail.com    63
4   Ahmed     Mari      ahmed@gmail.com  None
7      NA  Missing  Anonymous@gmail.com    NA

In [69]:
df2.replace({'NA':np.nan,'Missing': np.nan},inplace=True) # removing custom missing values
df2.dropna()

    first    last             email age
0   Azhar     Ali   Azhar@gmail.com  33
1     Ali  Sahito     ali@gmail.com  55
2  sahito   Azhar  sahito@gmail.com  63

In [72]:
df2.isna() # shows True where is na value

   first   last  email    age
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False
3  False   True  False  False
4  False  False  False   True
5   True   True   True   True
6   True   True   True   True
7   True   True  False   True

In [74]:
df2.fillna(0) # replacing na values with 0

    first    last                email age
0   Azhar     Ali      Azhar@gmail.com  33
1     Ali  Sahito        ali@gmail.com  55
2  sahito   Azhar     sahito@gmail.com  63
3   Humza       0      hamza@gmail.com  36
4   Ahmed    Mari      ahmed@gmail.com   0
5       0       0                    0   0
6       0       0                    0   0
7       0       0  Anonymous@gmail.com   0

In [78]:
df2.dtypes

first    object
last     object
email    object
age      object
dtype: object

In [82]:
df2['age'] = df2["age"].astype(float) # type casting , na/nan values are float 
df2.dtypes

first     object
last      object
email     object
age      float64
dtype: object

In [87]:
df2['age'].mean() # avgerage age

46.75